sleemanj/ATTinyCore/avr/boards.txt
# Overhauled summer 2015 by Dr. Azzy (Spence Konde) and again in early 2016 to add support for more chips.
# Significant overhaul again in summer 2020 for micronucleus boards.

menu.chip=Chip
menu.clock=Clock
menu.sketchclock=Clock (controls sketch only)
menu.bod=B.O.D. Level (Only set on ISP bootload)
menu.bodact=B.O.D. Mode (active)
menu.bodpd=B.O.D. Mode (sleep)
menu.eesave=Save EEPROM
menu.pinmapping=Pin Mapping
menu.INITIALIZE_SECONDARY_TIMERS=Initialize Secondary Timers
menu.TimerClockSource=Timer 1 Clock
menu.print=Print Support
menu.serial=Serial Support
menu.millis_ppm=Millis Accuracy
menu.millis_tone=Millis, Tone Support
menu.LTO=LTO (1.6.11+ only)
menu.bootUART=Bootloader UART
menu.wiremode=Wire Modes
menu.neopixelport=tinyNeoPixel port
menu.millis=millis()/micros()
menu.burnmode=Burn Bootloader Method
menu.bootentry=Burn Boot Entry Mode
menu.resetpin=Reset Pin (Only set on ISP bootload)

attiny13.name=ATtiny13
attiny13.upload.maximum_size=1024
attiny13.upload.maximum_data_size=64
attiny13.upload.tool=avrdude_noefuse
attiny13.bootloader.tool=avrdude_nobootloader_noefuse
attiny13.bootloader.unlock_bits=0x3F
attiny13.bootloader.lock_bits=0x3F
attiny13.build.core=tiny
attiny13.build.board=AVR_ATTINY13
attiny13.menu.chip.13=ATtiny13
attiny13.menu.chip.13.build.mcu=attiny13
attiny13.menu.chip.13.upload.maximum_size=1024
attiny13.menu.chip.13.upload.maximum_data_size=64
attiny13.menu.clock.96internal=9.6 MHz (internal)
attiny13.menu.clock.96internal.bootloader.low_fuses=0x7A
attiny13.menu.clock.96internal.build.f_cpu=9600000L
attiny13.menu.clock.96internal.bootloader.file=empty/empty_all.hex
attiny13.menu.clock.48internal=4.8 MHz (internal)
attiny13.menu.clock.48internal.bootloader.low_fuses=0x79
attiny13.menu.clock.48internal.build.f_cpu=4800000L
attiny13.menu.clock.48internal.bootloader.file=empty/empty_all.hex
attiny13.menu.clock.12internal=1.2 MHz (internal)
attiny13.menu.clock.12internal.bootloader.low_fuses=0x62
attiny13.menu.clock.12internal.build.f_cpu=1200000L
attiny13.menu.clock.12internal.bootloader.file=empty/empty_all.hex
attiny13.menu.bod.disable=B.O.D. Disabled
attiny13.menu.bod.disable.bootloader.high_fuses=0xFF
attiny13.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny13.menu.bod.1v8.bootloader.high_fuses=0xFD
attiny13.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny13.menu.bod.2v7.bootloader.high_fuses=0xFB
attiny13.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny13.menu.bod.4v3.bootloader.high_fuses=0xF9
attiny13.build.variant=tiny13

# Millis, Tone Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#attiny13.menu.core.FullCore=Millis and Tone Available
#attiny13.menu.core.FullCore.build.variant=tiny13
#attiny13.menu.core.FullCore.build.core=tiny
#attiny13.menu.core.FullCore.build.extra_flags=

attiny13.menu.core.MillisCore=Millis Available, No Tone
attiny13.menu.core.MillisCore.build.variant=tiny13
attiny13.menu.core.MillisCore.build.core=tiny
attiny13.menu.core.MillisCore.build.extra_flags=-DNO_TONE

attiny13.menu.core.ToneCore=Tone Available, No Millis
attiny13.menu.core.ToneCore.build.variant=tiny13
attiny13.menu.core.ToneCore.build.core=tiny
attiny13.menu.core.ToneCore.build.extra_flags=-DNO_MILLIS

attiny13.menu.core.SmallestCore=No Millis, No Tone
attiny13.menu.core.SmallestCore.build.variant=tiny13
attiny13.menu.core.SmallestCore.build.core=tiny
attiny13.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny13.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny13.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny13.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny13.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny13.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny13.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

# The tiny13 doesn't have enough RAM to do Arbitrary Bases
# attiny13.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
# attiny13.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny13.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny13.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny13.menu.print.Dec=Dec Only Supported
attiny13.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny13.menu.print.Hex=Hex Only Supported
attiny13.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny13.menu.print.Oct=Oct Only Supported
attiny13.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny13.menu.print.Bin=Bin Only Supported (Smallest)
attiny13.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN


# Millis Accuracy (tiny13 only currently)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny13.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny13.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny13.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny13.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny13.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny13.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny13.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny13.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny13.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

